**Name:** Yutika Rege

**PRN:** 190202012

**DS303:** Machine Learning 1

**Task:** Perform an exploratory data analysis on this dataset with the following sections. Use libraries.

**Problem Statement:** Refer Data: Home.csv

In [1]:
import pandas as pd
import numpy as np

**1. Read data using Pandas.**

In [2]:
df = pd.read_csv("Home.csv")
df

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

**2. Replace null value with relevant data.**

In [3]:
# using mode to impute the missing value
df["Bedrooms"].mode()

0    3.0
dtype: float64

In [4]:
df = df.fillna(3)

In [5]:
df

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

**3. Display total number of 3 Bedroom homes.**

In [6]:
bhk = df[df["Bedrooms"]==3].count()
print("No. of 3 BHK houses:\t",bhk[1])

No. of 3 BHK houses:	 3

**4. Display average area of 3 Bedroom homes.**

In [7]:
grp = df.groupby("Bedrooms")["Area"].mean()
pd.DataFrame(grp)
grp.reset_index(drop=True, inplace=True)
np.array(grp)
print("Average Area of 3 BHK Houses:\t",round(grp.iloc[0]))

Average Area of 3 BHK Houses:	 3133.0

**5. Rearrange data as per the price column in ascending order.**

In [8]:
df.sort_values(by=["Price"])

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
3  3600       3.0   30  595000
2  3200       3.0   18  610000
4  4000       5.0    8  760000

**6. Display all homes which are in age range of  > 8  and  < 16.**

In [9]:
df[(df["Age"]>8) & (df["Age"]<16)]

   Area  Bedrooms  Age   Price
1  3000       4.0   15  565000